In [6]:
import mysql.connector as m
mydb = m.connect(host='localhost',user='root',passwd='******',database='bank_database')

In [9]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(100, 'DAVID', 'WALLACE', datetime.date(1967, 11, 7), 'M', 250000, None, 1)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, 100, 2)
(106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3)
(107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3)
(108, 'Jim', 'Halpart', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)

In [10]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM client")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(400, 'Dunmore Highschool', 2)
(401, 'Lackawana Country', 2)
(402, 'FedEx', 3)
(403, 'John Daly Law, LLC', 3)
(404, 'Scranton Whitepages', 2)
(405, 'Times Newspaper', 3)
(406, 'FedEx', 2)

In [11]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM employee ORDER BY salary ASC")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, 100, 2)
(108, 'Jim', 'Halpart', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(100, 'DAVID', 'WALLACE', datetime.date(1967, 11, 7), 'M', 250000, None, 1)

In [10]:
mycursor.execute('SELECT * FROM branch')

In [12]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM employee ORDER BY salary DESC")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(100, 'DAVID', 'WALLACE', datetime.date(1967, 11, 7), 'M', 250000, None, 1)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(108, 'Jim', 'Halpart', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, 100, 2)
(107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)

In [15]:
#Find all the employee ordered by sex then name
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM employee ORDER BY sex, first_name,last_name")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)
(107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3)
(100, 'DAVID', 'WALLACE', datetime.date(1967, 11, 7), 'M', 250000, None, 1)
(108, 'Jim', 'Halpart', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)
(106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, 100, 2)

In [17]:
#Find the first 5 employee in the table
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM employee LIMIT 5")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(100, 'DAVID', 'WALLACE', datetime.date(1967, 11, 7), 'M', 250000, None, 1)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)

In [18]:
#Find first and last names of all employee
mycursor = mydb.cursor()
mycursor.execute("SELECT first_name,last_name FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

('DAVID', 'WALLACE')
('Jan', 'Levinson')
('Michael', 'Scott')
('Angela', 'Martin')
('Kelly', 'Kapoor')
('Stanley', 'Hudson')
('Josh', 'Porter')
('Andy', 'Bernard')
('Jim', 'Halpart')

In [20]:
# Find out all the diferent genders
mycursor = mydb.cursor()
mycursor.execute("SELECT DISTINCT sex FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

('M',)
('F',)

In [21]:
# Find out all the diferent branch_id
mycursor = mydb.cursor()
mycursor.execute("SELECT DISTINCT branch_id FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(1,)
(2,)
(3,)

## FUNCTIONS

In [22]:
#Find the number of employee
mycursor = mydb.cursor()
mycursor.execute("SELECT COUNT(emp_id) FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(9,)

In [24]:
#Find the number of supervisor
mycursor = mydb.cursor()
mycursor.execute("SELECT COUNT(super_id) FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(8,)

In [29]:
#Find the number of female employees born after 1970
mycursor = mydb.cursor()
mycursor.execute("SELECT COUNT(birth_day) FROM employee WHERE sex = 'F'AND birth_day > '1970-01-01'")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(2,)

In [30]:
#Find the average of all employee's salaries
mycursor = mydb.cursor()
mycursor.execute("SELECT AVG(salary) FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(Decimal('92888.8889'),)

In [31]:
#Find the average of all male employee's salaries 
mycursor = mydb.cursor()
mycursor.execute("SELECT AVG(salary) FROM employee WHERE sex='M'")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(Decimal('101333.3333'),)

In [33]:
#Find the sum of all employee's salaries
mycursor.execute("SELECT SUM(salary) FROM employee")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(Decimal('836000'),)

In [34]:
#Find out how many males and females there are 
mycursor.execute("SELECT COUNT(sex), sex FROM employee GROUP BY sex")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(3, 'F')
(6, 'M')

In [35]:
#Find the total sales of each salesman
mycursor.execute("SELECT SUM(total_sales),emp_id FROM work_with GROUP BY emp_id")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(Decimal('282000'), 102)
(Decimal('218000'), 105)
(Decimal('31000'), 107)
(Decimal('34500'), 108)

## WILDCARDS2

In [ ]:
#  % = any # characters, _ = one character
# Find any client's who are LLC
mycursor.execute("SELECT * FROM client WHERE client_name LIKE '%LLC'")

In [39]:
myresult=mycursor.fetchall()
for i in myresult:
    print(i)

(403, 'John Daly Law, LLC', 3)

In [40]:
# Find any branch suppliers who are in the label business
mycursor.execute("SELECT * FROM branch_supplier WHERE supplier_name LIKE '%label%'")
myresult=mycursor.fetchall()
for i in myresult:
    print(i)

(2, 'J.T. Forms & Labels', 'Custom Forms')

In [46]:
#Find all the employee born in october
mycursor.execute("SELECT * FROM employee WHERE birth_day LIKE '____-10%'")
myresult=mycursor.fetchall()
for i in myresult:
    print(i)

(108, 'Jim', 'Halpart', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)

In [47]:
#Find all the employee born in FEB
mycursor.execute("SELECT * FROM employee WHERE birth_day LIKE '____-02%'")
myresult=mycursor.fetchall()
for i in myresult:
    print(i)

(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, 100, 2)

In [48]:
# Find any clients who are schools
mycursor.execute("SELECT * FROM client WHERE client_name LIKE '%school%'")
myresult=mycursor.fetchall()
for i in myresult:
    print(i)

(400, 'Dunmore Highschool', 2)

## UNIONS

In [49]:
# FInd a list of employee and branch names
mycursor.execute("SELECT first_name FROM employee UNION SELECT branch_name FROM branch")
myresult=mycursor.fetchall()
for i in myresult:
    print(i)

('DAVID',)
('Jan',)
('Michael',)
('Angela',)
('Kelly',)
('Stanley',)
('Josh',)
('Andy',)
('Jim',)
('Corporate',)
('Scranton',)
('Stamford',)

 For Union we need to have
 
    same number of column
    same datatype

In [50]:
# Find a list of all clients and branch supplier's name
mycursor.execute("SELECT client_name FROM client UNION SELECT supplier_name FROM branch_supplier")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

('Dunmore Highschool',)
('Lackawana Country',)
('FedEx',)
('John Daly Law, LLC',)
('Scranton Whitepages',)
('Times Newspaper',)
('Hammer Mill',)
('J.T. Forms & Labels',)
('Uni Ball',)
('Patriot Paper',)
('Stamford Lables',)

In [52]:
# Find a list of all clients and branch supplier's name with ID'S
mycursor.execute("SELECT client.client_name,client.branch_id FROM client UNION SELECT branch_supplier.supplier_name, branch_supplier.branch_id FROM branch_supplier")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

('Dunmore Highschool', 2)
('Lackawana Country', 2)
('FedEx', 3)
('John Daly Law, LLC', 3)
('Scranton Whitepages', 2)
('Times Newspaper', 3)
('FedEx', 2)
('Hammer Mill', 2)
('J.T. Forms & Labels', 2)
('Uni Ball', 2)
('Hammer Mill', 3)
('Patriot Paper', 3)
('Stamford Lables', 3)
('Uni Ball', 3)

In [53]:
#Find money spend or earned by the company
mycursor.execute("SELECT employee.emp_id, employee.salary FROM employee UNION SELECT work_with.emp_id, work_with.total_sales FROM work_with")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(100, 250000)
(101, 110000)
(102, 75000)
(103, 63000)
(104, 55000)
(105, 69000)
(106, 78000)
(107, 65000)
(108, 71000)
(102, 267000)
(102, 15000)
(105, 55000)
(105, 33000)
(105, 130000)
(107, 5000)
(107, 26000)
(108, 22500)
(108, 12000)

## JOIN

In [ ]:
mycursor.execute("INSERT INTO branch VALUES(4,'Buffalo',NULL,NULL)")
mydb.commit()

In [55]:
mycursor.execute("SELECT * FROM branch")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(1, 'Corporate', 100, datetime.date(2006, 2, 9))
(2, 'Scranton', 102, datetime.date(1992, 4, 6))
(3, 'Stamford', 106, datetime.date(1998, 2, 13))
(4, 'Buffalo', None, None)

In [58]:
# Find all branches and the names of branch manager
mycursor.execute("SELECT employee.emp_id,employee.first_name,employee.last_name, branch.branch_name FROM employee JOIN branch ON employee.emp_id=branch.mgr_id")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(100, 'DAVID', 'WALLACE', 'Corporate')
(102, 'Michael', 'Scott', 'Scranton')
(106, 'Josh', 'Porter', 'Stamford')

In [59]:
# Find all branches and the names of branch manager
mycursor.execute("SELECT employee.emp_id,employee.first_name,employee.last_name, branch.branch_name FROM employee LEFT JOIN branch ON employee.emp_id=branch.mgr_id")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(100, 'DAVID', 'WALLACE', 'Corporate')
(102, 'Michael', 'Scott', 'Scranton')
(106, 'Josh', 'Porter', 'Stamford')
(101, 'Jan', 'Levinson', None)
(103, 'Angela', 'Martin', None)
(104, 'Kelly', 'Kapoor', None)
(105, 'Stanley', 'Hudson', None)
(107, 'Andy', 'Bernard', None)
(108, 'Jim', 'Halpart', None)

In [60]:
# Find all branches and the names of branch manager
mycursor.execute("SELECT employee.emp_id,employee.first_name,employee.last_name, branch.branch_name FROM employee RIGHT JOIN branch ON employee.emp_id=branch.mgr_id")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(100, 'DAVID', 'WALLACE', 'Corporate')
(102, 'Michael', 'Scott', 'Scranton')
(106, 'Josh', 'Porter', 'Stamford')
(None, None, None, 'Buffalo')

## NESTED QUERIES

In [61]:
#Find names of all employees who have sold over 30000 to a single client

In [67]:
mycursor.execute('''SELECT employee.first_name, employee.last_name
                    FROM employee
                    WHERE employee.emp_id IN (
                    SELECT work_with.emp_id 
                    FROM work_with
                    WHERE work_with.total_sales > 30000)''')
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

('Michael', 'Scott')
('Stanley', 'Hudson')

In [70]:
# Find all the clients who are handled by the branch manager Michael Scott assuming you kno ID of Michael

mycursor.execute('''SELECT employee.first_name,employee.last_name
                    FROM employee 
                    WHERE employee.emp_id IN (
                    SELECT employee.emp_id FROM employee WHERE employee.super_id = 102)''')
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

('Angela', 'Martin')
('Kelly', 'Kapoor')